// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	/// <summary>
	/// POCO -> Plain Old CLR Objects
	/// </summary>
	public class Category01 : object
	{
		public Category01() : base()
		{
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category02 : object
	{
		public Category02() : base()
		{
		}

		// **********
		public int ID { get; set; }
		// **********

		// **********
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category03 : object
	{
		public Category03() : base()
		{
		}

		// **********
		public int Category03Id { get; set; }
		// **********

		// **********
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category04 : object
	{
		public Category04() : base()
		{
		}

		// **********
		public int Category04ID { get; set; }
		// **********

		// **********
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
//namespace Models
//{
//	public class Category05 : object
//	{
//		public Category05() : base()
//		{
//		}

//		// **********
//		/// <summary>
//		/// خطا می‌دهد
//		/// </summary>
//		public int Key { get; set; }
//		// **********

//		// **********
//		public string? Name { get; set; }
//		// **********
//	}
//}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category06 : object
	{
		public Category06() : base()
		{
		}

		// **********
		/// <summary>
		/// این ویژگی فقط مربوط به بانک‌اطلاعاتی می‌شود
		/// 
		/// داریم Key چون در اسکیوال کلمه
		/// می‌شود [Key] تبدیل به
		/// </summary>
		[System.ComponentModel.DataAnnotations.Key]
		public int Key { get; set; }
		// **********

		// **********
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category07 : object
	{
		public Category07() : base()
		{
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		/// <summary>
		/// این ویژگی هم مربوط به برنامه می‌شود
		/// و هم مربوط به بانک اطلاعاتی می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.MaxLength
			(length: 100)]
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category08 : object
	{
		public Category08() : base()
		{
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		/// <summary>
		/// این ویژگی فقط مربوط به برنامه می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.MinLength
			(length: 3)]

		/// <summary>
		/// این ویژگی هم مربوط به برنامه می‌شود
		/// و هم مربوط به بانک اطلاعاتی می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.MaxLength
			(length: 100)]
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category09 : object
	{
		public Category09() : base()
		{
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		/// <summary>
		/// این ویژگی هم مربوط به برنامه می‌شود
		/// و هم مربوط به بانک اطلاعاتی می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.StringLength
			(maximumLength: 100)]
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category10 : object
	{
		public Category10() : base()
		{
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		/// <summary>
		/// بخشی از این ویژگی هم مربوط به برنامه می‌شود
		/// و هم مربوط به بانک اطلاعاتی می‌شود
		/// 
		/// و بخشی از آن صرفا مربوط به برنامه می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.StringLength
			(maximumLength: 100, MinimumLength = 3)]
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category11 : object
	{
		public Category11() : base()
		{
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		/// <summary>
		/// این ویژگی هم مربوط به برنامه می‌شود
		/// و هم مربوط به بانک اطلاعاتی می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.Required]

		[System.ComponentModel.DataAnnotations.StringLength
			(maximumLength: 100, MinimumLength = 3)]
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category12 : object
	{
		public Category12() : base()
		{
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		/// <summary>
		/// بخشی از این ویژگی هم مربوط به برنامه می‌شود
		/// و هم مربوط به بانک اطلاعاتی می‌شود
		/// 
		/// و بخشی از آن صرفا مربوط به برنامه می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.Required
			(AllowEmptyStrings = false)]

		[System.ComponentModel.DataAnnotations.StringLength
			(maximumLength: 100, MinimumLength = 3)]
		public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	/// <summary>
	/// طراحی هوشمندانه که در نسخه قبل امکان‌پذیر نبود
	/// </summary>
	public class Category13 : object
	{
		/// <summary>
		/// را می‌نوشتیم Default Constructor در نسخه قدیم باید حتما
		/// </summary>
		//public Category13() : base()
		//{
		//}

		public Category13(string name) : base()
		{
			Name = name;
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		[System.ComponentModel.DataAnnotations.Required
			(AllowEmptyStrings = false)]

		[System.ComponentModel.DataAnnotations.StringLength
			(maximumLength: 100, MinimumLength = 3)]
		public string Name { get; set; }
		//public string? Name { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************

// **************************************************
// **************************************************
// **************************************************
namespace Models
{
	public class Category14 : object
	{
		public Category14(string name) : base()
		{
			Name = name;
			Ordering = 10000;
		}

		// **********
		public int Id { get; set; }
		// **********

		// **********
		[System.ComponentModel.DataAnnotations.Required
			(AllowEmptyStrings = false)]

		[System.ComponentModel.DataAnnotations.StringLength
			(maximumLength: 100, MinimumLength = 3)]
		public string Name { get; set; }
		// **********

		// **********
		/// <summary>
		/// این ویژگی فقط مربوط به برنامه می‌شود
		/// </summary>
		[System.ComponentModel.DataAnnotations.Range
			(minimum: 1, maximum: 100000)]
		public int Ordering { get; set; }
		// **********
	}
}
// **************************************************
// **************************************************
// **************************************************
